Autodesk.Revit.DB.Visual.WallPaint.CommonTintColor
The property labeled "Tint Color" from the "WallPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.WallPaint.CommonTintToggle
The property labeled "Tint" from the "WallPaint" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.WallPaint.WallpaintApplication
The property labeled "Application" from the "WallPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.WallPaint.WallpaintFinish
The property labeled "Finish" from the "WallPaint" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintFinishType".
Since:
2018.1

Autodesk.Revit.DB.Visual.WallPaint.WallpaintColor
The property labeled "Color" from the "WallPaint" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.WallPaint
Represents the properties of materials.
Since:
2018.1